[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item as={Link} to="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <>
+                  <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                    <NavDropdown.Item as={Link} to="/admin/users">
+                      Users
+                    </NavDropdown.Item>
+                  </NavDropdown>
+                </>}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests admin dropdown renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <>
-                  <NavDropdown
-                    title="Admin"
-                    id="appnavbar-admin-dropdown"
-                    data-testid="appnavbar-admin-dropdown"
-                  >
-                    <NavDropdown.Item as={Link} to="/admin/users">
-                      Users
-                    </NavDropdown.Item>
-                  </NavDropdown>
-                </>
-              )}
+              {true}
 
               {(hasRole(currentUser, "ROLE_ADMIN") ||
killedBy: AppNavbar tests admin dropdown renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:66:16
                 </>
               )}
 
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <>
-                  <Nav.Link
-                    id="appnavbar-admin/moderator-dropdown"
-                    data-testid="appnavbar-admin/moderator-dropdown"
-                    as={Link}
-                    to="/moderate"
-                  >
-                    Moderate
-                  </Nav.Link>
-                </>
-              )}
+              {true}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests moderate renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin/moderator-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:66:17
                 </>
               )}
 
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
+              {(hasRole(currentUser, "ROLE_ADMIN") && hasRole(currentUser, "ROLE_MODERATOR")) && (
                 <>
                   <Nav.Link
killedBy: AppNavbar tests moderate renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin/moderator-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
