[Killed] BlockStatement
main/pages/Reviews/ReviewsForMenuItemPage.js:5:50
 import { useParams } from "react-router";
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function ReviewsForMenuItemPage() {
-  const { itemid } = useParams();
-  return (
-    <BasicLayout>
-      <h1>Reviews for Menu Item {itemid}</h1>
-      <p>Coming Soon!</p>
-    </BasicLayout>
-  );
-}
+export default function ReviewsForMenuItemPage() {}
 
killedBy: ReviewsForMenuItemPage renders placeholder with correct itemid
statusReason: TestingLibraryElementError: Unable to find an element with the text: Reviews for Menu Item 42. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
