[Killed] BlockStatement
main/pages/Reviews/ReviewsCreatePage.js:4:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router";
 
-export default function ReviewCreatePage() {
-  const { id } = useParams();
-  // Stryker disable all : placeholder for future implementations
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Post a review for Menu Item {id}</h1>
-        <p>Coming Soon!</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewCreatePage() {}
 
killedBy: ReviewsCreatePage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Post a review for Menu Item. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
