[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:27:29
     {
       Header: "Avg Rating",
       accessor: "avgRating",
-      Cell: ({ value }) => (value == null ? "—" : value.toFixed(1)),
+      Cell: ({ value }) => (value != null ? "—" : value.toFixed(1)),
     },
   ];
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly and Reviews link is correct
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:27:29
     {
       Header: "Avg Rating",
       accessor: "avgRating",
-      Cell: ({ value }) => (value == null ? "—" : value.toFixed(1)),
+      Cell: ({ value }) => (false ? "—" : value.toFixed(1)),
     },
   ];
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly and Reviews link is correct
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')
