[Killed] ArrayDeclaration
main/components/Reviews/ReviewTable.js:12:19
   onApprove,
   onReject,
 }) {
-  const columns = [
-    { Header: "Item ID", accessor: "itemId" },
-    { Header: "Score", accessor: "itemsStars" },
-    { Header: "Comments", accessor: "reviewerComments" },
-    { Header: "Date Served", accessor: "dateItemServed" },
-  ];
+  const columns = [];
 
   if (userOptions) {
killedBy: ReviewTable Tests Headers and data render correctly (minimal)
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewTable.js:13:15
   onReject,
 }) {
   const columns = [
-    { Header: "Item ID", accessor: "itemId" },
+    { Header: "", accessor: "itemId" },
     { Header: "Score", accessor: "itemsStars" },
     { Header: "Comments", accessor: "reviewerComments" },
killedBy: ReviewTable Tests Headers and data render correctly (minimal)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Item ID
Received:
