[Timeout] StringLiteral
main/components/Alias/AliasTable.js:5:18
 import OurTable, { ButtonColumn } from "main/components/OurTable";
 
 export default function AliasTable({ aliases, onApprove, onReject }) {
-  const testid = "AliasTable";
+  const testid = "";
 
   const columns = [

[Killed] ObjectLiteral
main/components/Alias/AliasTable.js:8:5
   const testid = "AliasTable";
 
   const columns = [
-    {
-      Header: "Proposed Alias",
-      accessor: "proposedAlias",
-      Cell: ({ value }) => value || "(No proposed alias)",
-    },
+    {},
     ButtonColumn(
       "Approve",
killedBy: ModeratePage enhanced tests renders correctly for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Alias/AliasTable.js:10:17
   const columns = [
     {
       Header: "Proposed Alias",
-      accessor: "proposedAlias",
+      accessor: "",
       Cell: ({ value }) => value || "(No proposed alias)",
     },
killedBy: AliasTable tests renders table with provided aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  data-testid="AliasTable-row-0"
  role="row"
>
  <td

[Killed] LogicalOperator
main/components/Alias/AliasTable.js:11:28
     {
       Header: "Proposed Alias",
       accessor: "proposedAlias",
-      Cell: ({ value }) => value || "(No proposed alias)",
+      Cell: ({ value }) => value && "(No proposed alias)",
     },
     ButtonColumn(
killedBy: AliasTable tests renders table with provided aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  data-testid="AliasTable-row-0"
  role="row"
>
  <td

[Killed] ConditionalExpression
main/components/Alias/AliasTable.js:11:28
     {
       Header: "Proposed Alias",
       accessor: "proposedAlias",
-      Cell: ({ value }) => value || "(No proposed alias)",
+      Cell: ({ value }) => false,
     },
     ButtonColumn(
killedBy: AliasTable tests renders table with provided aliases
statusReason: TestingLibraryElementError: Unable to find an element with the text: Ali1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<tr
  data-testid="AliasTable-row-0"
  role="row"
>
  <td

[Killed] StringLiteral
main/components/Alias/AliasTable.js:15:7
     },
     ButtonColumn(
       "Approve",
-      "primary",
+      "",
       (cell) => onApprove(cell.row.original),
       testid,
killedBy: AliasTable tests Approve button has primary class
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] ArrowFunction
main/components/Alias/AliasTable.js:16:7
     ButtonColumn(
       "Approve",
       "primary",
-      (cell) => onApprove(cell.row.original),
+      () => undefined,
       testid,
     ),
killedBy: AliasTable tests calls onApprove when Approve button clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] ArrowFunction
main/components/Alias/AliasTable.js:22:7
     ButtonColumn(
       "Reject",
       "danger",
-      (cell) => onReject(cell.row.original),
+      () => undefined,
       testid,
     ),
killedBy: AliasTable tests calls onReject when Reject button clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] BlockStatement
main/components/Alias/AliasTable.js:27:41
     ),
   ];
 
-  if (!aliases || aliases.length === 0) {
-    return (
-      <div data-testid={`${testid}-empty`}>No aliases awaiting approval</div>
-    );
-  }
+  if (!aliases || aliases.length === 0) {}
 
   return <OurTable data={aliases} columns={columns} testid={testid} />;
killedBy: AliasTable tests renders empty state when no aliases provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AliasTable-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Alias/AliasTable.js:27:7
     ),
   ];
 
-  if (!aliases || aliases.length === 0) {
+  if (!aliases && aliases.length === 0) {
     return (
       <div data-testid={`${testid}-empty`}>No aliases awaiting approval</div>
killedBy: AliasTable tests renders empty state when no aliases provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="AliasTable-empty"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
