[Killed] StringLiteral
src/main/pages/Moderate.js:13:32
 const Moderate = () => {
   const { data: currentUser } = useCurrentUser();
 
-  const { data } = useBackend(["/api/admin/usersWithProposedAlias"], {
+  const { data } = useBackend([""], {
     method: "GET",
     url: "/api/admin/usersWithProposedAlias",
killedBy: ModeratePage enhanced tests hooks into backend with the correct endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Array [
-   "/api/admin/usersWithProposedAlias",
+   "",

[Killed] ObjectLiteral
src/main/pages/Moderate.js:13:70
 const Moderate = () => {
   const { data: currentUser } = useCurrentUser();
 
-  const { data } = useBackend(["/api/admin/usersWithProposedAlias"], {
-    method: "GET",
-    url: "/api/admin/usersWithProposedAlias",
-  });
+  const { data } = useBackend(["/api/admin/usersWithProposedAlias"], {});
 
   if (
killedBy: ModeratePage enhanced tests hooks into backend with the correct endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  ["/api/admin/usersWithProposedAlias"],
- Object {
-   "method": "GET",

[Killed] StringLiteral
src/main/pages/Moderate.js:14:13
   const { data: currentUser } = useCurrentUser();
 
   const { data } = useBackend(["/api/admin/usersWithProposedAlias"], {
-    method: "GET",
+    method: "",
     url: "/api/admin/usersWithProposedAlias",
   });
killedBy: ModeratePage enhanced tests hooks into backend with the correct endpoint and options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  ["/api/admin/usersWithProposedAlias"],
  Object {
-   "method": "GET",

[Killed] LogicalOperator
src/main/pages/Moderate.js:19:5
   });
 
   if (
-    !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+    !currentUser.loggedIn && !hasRole(currentUser, "ROLE_ADMIN") && !hasRole(currentUser, "ROLE_MODERATOR")
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage enhanced tests redirects non-admin/non-moderator user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/Moderate.js:19:5
   });
 
   if (
-    !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+    false
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage enhanced tests redirects non-admin/non-moderator user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ConditionalExpression
src/main/pages/Moderate.js:20:6
 
   if (
     !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+    (false)
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage enhanced tests redirects non-admin/non-moderator user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] LogicalOperator
src/main/pages/Moderate.js:20:6
 
   if (
     !currentUser.loggedIn ||
-    (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+    (!hasRole(currentUser, "ROLE_ADMIN") || !hasRole(currentUser, "ROLE_MODERATOR"))
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage enhanced tests admin-only user still sees page (kills the &&->|| mutant)
statusReason: Error: Unable to find an element with the text: Moderation Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] BooleanLiteral
src/main/pages/Moderate.js:21:7
   if (
     !currentUser.loggedIn ||
     (!hasRole(currentUser, "ROLE_ADMIN") &&
-      !hasRole(currentUser, "ROLE_MODERATOR"))
+      hasRole(currentUser, "ROLE_MODERATOR"))
   ) {
     return <Navigate to="/" />;
killedBy: ModeratePage enhanced tests redirects non-admin/non-moderator user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/Moderate.js:22:5
     !currentUser.loggedIn ||
     (!hasRole(currentUser, "ROLE_ADMIN") &&
       !hasRole(currentUser, "ROLE_MODERATOR"))
-  ) {
-    return <Navigate to="/" />;
-  }
+  ) {}
 
   const handleApprove = async (alias) => {
killedBy: ModeratePage enhanced tests redirects non-admin/non-moderator user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>Moderation Page</h1> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] BlockStatement
src/main/pages/Moderate.js:26:42
     return <Navigate to="/" />;
   }
 
-  const handleApprove = async (alias) => {
-    try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: true },
-      });
-      toast.success(
-        `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
-      );
-    } catch (err) {
-      toast.error(`Error approving alias: ${err.message || "Unknown error"}`);
-    }
-  };
+  const handleApprove = async (alias) => {};
 
   const handleReject = async (alias) => {
killedBy: ModeratePage enhanced tests triggers toast.success when clicking approve & reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Alias \"Ali1\""

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/main/pages/Moderate.js:27:9
   }
 
   const handleApprove = async (alias) => {
-    try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: true },
-      });
-      toast.success(
-        `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
-      );
-    } catch (err) {
+    try {} catch (err) {
       toast.error(`Error approving alias: ${err.message || "Unknown error"}`);
     }
killedBy: ModeratePage enhanced tests triggers toast.success when clicking approve & reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Alias \"Ali1\""

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
src/main/pages/Moderate.js:28:23
 
   const handleApprove = async (alias) => {
     try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
+      await axios.put("", null, {
         params: { id: alias.id, approved: true },
       });
killedBy: ModeratePage enhanced tests triggers toast.success when clicking approve & reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Alias \"Ali1\""

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ObjectLiteral
src/main/pages/Moderate.js:28:71
 
   const handleApprove = async (alias) => {
     try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: true },
-      });
+      await axios.put("/api/currentUser/updateAliasModeration", null, {});
       toast.success(
         `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
killedBy: ModeratePage enhanced tests approve calls axios.put with correct params and toast.success with full message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/currentUser/updateAliasModeration",
  null,
- Object {

[Killed] BooleanLiteral
src/main/pages/Moderate.js:29:43
   const handleApprove = async (alias) => {
     try {
       await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: true },
+        params: { id: alias.id, approved: false },
       });
       toast.success(
killedBy: ModeratePage enhanced tests approve calls axios.put with correct params and toast.success with full message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/currentUser/updateAliasModeration",
  null,
  Object {

[Killed] StringLiteral
src/main/pages/Moderate.js:32:9
         params: { id: alias.id, approved: true },
       });
       toast.success(
-        `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
+        ``,
       );
     } catch (err) {
killedBy: ModeratePage enhanced tests triggers toast.success when clicking approve & reject
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Alias \"Ali1\""
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/pages/Moderate.js:34:19
       toast.success(
         `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
       );
-    } catch (err) {
-      toast.error(`Error approving alias: ${err.message || "Unknown error"}`);
-    }
+    } catch (err) {}
   };
 
killedBy: ModeratePage enhanced tests shows toast.error when approve fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error approving alias: Approve failed"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
src/main/pages/Moderate.js:35:45
         `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
       );
     } catch (err) {
-      toast.error(`Error approving alias: ${err.message || "Unknown error"}`);
+      toast.error(`Error approving alias: ${false}`);
     }
   };
killedBy: ModeratePage enhanced tests shows toast.error when approve fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error approving alias: Approve failed"
Received: "Error approving alias: false"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/main/pages/Moderate.js:35:45
         `Alias "${alias.proposedAlias}" for ID ${alias.id} approved!`,
       );
     } catch (err) {
-      toast.error(`Error approving alias: ${err.message || "Unknown error"}`);
+      toast.error(`Error approving alias: ${err.message && "Unknown error"}`);
     }
   };
killedBy: ModeratePage enhanced tests shows toast.error when approve fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error approving alias: Approve failed"
Received: "Error approving alias: Unknown error"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/pages/Moderate.js:39:41
     }
   };
 
-  const handleReject = async (alias) => {
-    try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: false },
-      });
-      toast.success(
-        `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
-      );
-    } catch (err) {
-      toast.error(`Error rejecting alias: ${err.message || "Unknown error"}`);
-    }
-  };
+  const handleReject = async (alias) => {};
 
   return (
killedBy: ModeratePage enhanced tests shows toast.error when reject fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error rejecting alias: Reject failed"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
src/main/pages/Moderate.js:40:9
   };
 
   const handleReject = async (alias) => {
-    try {
-      await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: false },
-      });
-      toast.success(
-        `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
-      );
-    } catch (err) {
+    try {} catch (err) {
       toast.error(`Error rejecting alias: ${err.message || "Unknown error"}`);
     }
killedBy: ModeratePage enhanced tests shows toast.error when reject fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error rejecting alias: Reject failed"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BooleanLiteral
src/main/pages/Moderate.js:42:43
   const handleReject = async (alias) => {
     try {
       await axios.put("/api/currentUser/updateAliasModeration", null, {
-        params: { id: alias.id, approved: false },
+        params: { id: alias.id, approved: true },
       });
       toast.success(
killedBy: ModeratePage enhanced tests reject calls axios.put with correct params and toast.success with full message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/api/currentUser/updateAliasModeration",
  null,
  Object {

[Killed] BlockStatement
src/main/pages/Moderate.js:47:19
       toast.success(
         `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
       );
-    } catch (err) {
-      toast.error(`Error rejecting alias: ${err.message || "Unknown error"}`);
-    }
+    } catch (err) {}
   };
 
killedBy: ModeratePage enhanced tests shows toast.error when reject fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error rejecting alias: Reject failed"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] LogicalOperator
src/main/pages/Moderate.js:48:45
         `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
       );
     } catch (err) {
-      toast.error(`Error rejecting alias: ${err.message || "Unknown error"}`);
+      toast.error(`Error rejecting alias: ${err.message && "Unknown error"}`);
     }
   };
killedBy: ModeratePage enhanced tests shows toast.error when reject fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error rejecting alias: Reject failed"
Received: "Error rejecting alias: Unknown error"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/pages/Moderate.js:48:45
         `Alias "${alias.proposedAlias}" for ID ${alias.id} rejected!`,
       );
     } catch (err) {
-      toast.error(`Error rejecting alias: ${err.message || "Unknown error"}`);
+      toast.error(`Error rejecting alias: ${false}`);
     }
   };
killedBy: ModeratePage enhanced tests shows toast.error when reject fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "Error rejecting alias: Reject failed"
Received: "Error rejecting alias: false"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/pages/Moderate.js:60:20
           This page is accessible only to admins and moderators. (Placeholder)
         </p>
         <AliasTable
-          aliases={data || []}
+          aliases={false}
           onApprove={handleApprove}
           onReject={handleReject}
killedBy: ModeratePage enhanced tests triggers toast.success when clicking approve & reject
statusReason: Error: Unable to find an element by: [data-testid="AliasTable-cell-row-0-col-Approve"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/Moderate.js:60:20
           This page is accessible only to admins and moderators. (Placeholder)
         </p>
         <AliasTable
-          aliases={data || []}
+          aliases={true}
           onApprove={handleApprove}
           onReject={handleReject}
killedBy: ModeratePage enhanced tests renders correctly for admin user
statusReason: TypeError: data.forEach is not a function
