[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:27:20
   ];
   if (hasRole(currentUser, "ROLE_USER")) {
     columns.push(
-      ButtonColumn("Review Item", "warning", reviewCallback, testid),
+      ButtonColumn("", "warning", reviewCallback, testid),
     );
   }
killedBy: MenuItemTable Tests Review Item button appears for ROLE_USER and alert works
statusReason: Error: A column ID (or string accessor) is required!
