[Timeout] ArrayDeclaration
main/components/Reviews/ReviewTable.js:12:19
   onApprove,
   onReject,
 }) {
-  const columns = [
-    { Header: "Item ID", accessor: (row) => row.item?.id ?? row.itemId ?? "" },
-    { Header: "Score", accessor: "itemsStars" },
-    { Header: "Comments", accessor: "reviewerComments" },
-    { Header: "Date Served", accessor: "dateItemServed" },
-  ];
+  const columns = [];
 
   if (userOptions) {

[Killed] ArrowFunction
main/components/Reviews/ReviewTable.js:13:36
   onReject,
 }) {
   const columns = [
-    { Header: "Item ID", accessor: (row) => row.item?.id ?? row.itemId ?? "" },
+    { Header: "Item ID", accessor: () => undefined },
     { Header: "Score", accessor: "itemsStars" },
     { Header: "Comments", accessor: "reviewerComments" },
killedBy: ReviewsForMenuItemPage renders correct data for different itemids (query key cache test)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] LogicalOperator
main/components/Reviews/ReviewTable.js:13:45
   onReject,
 }) {
   const columns = [
-    { Header: "Item ID", accessor: (row) => row.item?.id ?? row.itemId ?? "" },
+    { Header: "Item ID", accessor: (row) => (row.item?.id ?? row.itemId) && "" },
     { Header: "Score", accessor: "itemsStars" },
     { Header: "Comments", accessor: "reviewerComments" },
killedBy: ReviewsForMenuItemPage renders correct data for different itemids (query key cache test)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Timeout] ObjectLiteral
main/components/Reviews/ReviewTable.js:15:5
   const columns = [
     { Header: "Item ID", accessor: (row) => row.item?.id ?? row.itemId ?? "" },
     { Header: "Score", accessor: "itemsStars" },
-    { Header: "Comments", accessor: "reviewerComments" },
+    {},
     { Header: "Date Served", accessor: "dateItemServed" },
   ];

[Timeout] StringLiteral
main/components/Reviews/ReviewTable.js:15:37
   const columns = [
     { Header: "Item ID", accessor: (row) => row.item?.id ?? row.itemId ?? "" },
     { Header: "Score", accessor: "itemsStars" },
-    { Header: "Comments", accessor: "reviewerComments" },
+    { Header: "Comments", accessor: "" },
     { Header: "Date Served", accessor: "dateItemServed" },
   ];

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:24:40
       ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", onDelete || (() => {}), "ReviewTable"),
+      ButtonColumn("Delete", "danger", true, "ReviewTable"),
     );
   }
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: TypeError: callback is not a function

[Killed] BlockStatement
main/components/Reviews/ReviewTable.js:28:25
     );
   }
 
-  if (moderatorOptions) {
-    columns.push(
-      ButtonColumn(
-        "Approve",
-        "success",
-        onApprove || (() => {}),
-        "ReviewTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn("Reject", "danger", onReject || (() => {}), "ReviewTable"),
-    );
-  }
+  if (moderatorOptions) {}
 
   return <OurTable data={data} columns={columns} testid="ReviewTable" />;
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-Approve"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:33:9
       ButtonColumn(
         "Approve",
         "success",
-        onApprove || (() => {}),
+        false,
         "ReviewTable",
       ),
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TypeError: callback is not a function

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:38:40
       ),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", onReject || (() => {}), "ReviewTable"),
+      ButtonColumn("Reject", "danger", false, "ReviewTable"),
     );
   }
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TypeError: callback is not a function
