[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:6:18
 import { Link } from "react-router";
 
 export default function MenuItemTable({ menuItems, currentUser }) {
-  const testid = "MenuItemTable";
+  const testid = "";
   const reviewCallback = async (_cell) => {
     alert("Reviews coming soon!");
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly
statusReason: Error: Unable to find an element by: [data-testid="MenuItemTable-cell-row-0-col-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:12:15
   };
   const columns = [
     {
-      Header: "Item Name",
+      Header: "",
       accessor: "name",
     },
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Item Name
Received:

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:17:17
     },
     {
       Header: "Station",
-      accessor: "station",
+      accessor: "",
     },
     {
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemTable-header-station"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/MenuItem/MenuItemTable.js:22:13
     {
       Header: "Reviews",
       accessor: "id",
-      Cell: ({ value }) => <Link to={`/reviews/${value}`}>Reviews</Link>,
+      Cell: () => undefined,
     },
     {
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "link" and name "Reviews"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<td
  data-

[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:22:38
     {
       Header: "Reviews",
       accessor: "id",
-      Cell: ({ value }) => <Link to={`/reviews/${value}`}>Reviews</Link>,
+      Cell: ({ value }) => <Link to={``}>Reviews</Link>,
     },
     {
statusReason: Error: expect(element).toHaveAttribute("href", "/reviews/undefined") // element.getAttribute("href") === "/reviews/undefined"

Expected the element to have attribute:
  href="/reviews/undefined"
Received:
  href="/"

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:27:29
     {
       Header: "Avg Rating",
       accessor: "averageRating",
-      Cell: ({ value }) => (value == null ? "—" : value.toFixed(1)),
+      Cell: ({ value }) => (value != null ? "—" : value.toFixed(1)),
     },
   ];
killedBy: MenuItemPage renders table correctly MenuItemPage renders 5 Menu Items Correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'toFixed')

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:27:29
     {
       Header: "Avg Rating",
       accessor: "averageRating",
-      Cell: ({ value }) => (value == null ? "—" : value.toFixed(1)),
+      Cell: ({ value }) => (true ? "—" : value.toFixed(1)),
     },
   ];
killedBy: MenuItemTable Tests Avg Rating cell shows one decimal
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  3.5
Received:
  —
