[Killed] ArrayDeclaration
main/components/Reviews/ReviewTable.js:12:19
   onApprove,
   onReject,
 }) {
-  const columns = [
-    {
-      Header: "Item ID",
-      accessor: (row) => row.item?.id ?? row.item ?? row.itemId ?? "",
-    },
-    { Header: "Score", accessor: "itemsStars" },
-    { Header: "Comments", accessor: "reviewerComments" },
-    { Header: "Date Served", accessor: "dateItemServed" },
-  ];
+  const columns = [];
 
   if (userOptions) {
killedBy: ReviewsForMenuItemPage filters out reviews with null comments
statusReason: Error: Unable to find an element with the text: Great!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Reviews/ReviewTable.js:15:26
   const columns = [
     {
       Header: "Item ID",
-      accessor: (row) => row.item?.id ?? row.item ?? row.itemId ?? "",
+      accessor: (row) => row.item?.id && row.item ?? row.itemId ?? "",
     },
     { Header: "Score", accessor: "itemsStars" },
killedBy: ReviewTable Tests renders Item ID from item.id when item is an object with id
statusReason: Error: Objects are not valid as a React child (found: object with keys {id}). If you meant to render a collection of children, use an array instead.

[Killed] ArrowFunction
main/components/Reviews/ReviewTable.js:15:17
   const columns = [
     {
       Header: "Item ID",
-      accessor: (row) => row.item?.id ?? row.item ?? row.itemId ?? "",
+      accessor: () => undefined,
     },
     { Header: "Score", accessor: "itemsStars" },
killedBy: ReviewsForMenuItemPage renders correct data for different itemids (query key cache test)
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  42
Received:

[Killed] StringLiteral
main/components/Reviews/ReviewTable.js:17:34
       Header: "Item ID",
       accessor: (row) => row.item?.id ?? row.item ?? row.itemId ?? "",
     },
-    { Header: "Score", accessor: "itemsStars" },
+    { Header: "Score", accessor: "" },
     { Header: "Comments", accessor: "reviewerComments" },
     { Header: "Date Served", accessor: "dateItemServed" },
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-itemsStars"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewTable.js:19:40
     },
     { Header: "Score", accessor: "itemsStars" },
     { Header: "Comments", accessor: "reviewerComments" },
-    { Header: "Date Served", accessor: "dateItemServed" },
+    { Header: "Date Served", accessor: "" },
   ];
 
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-dateItemServed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Reviews/ReviewTable.js:19:5
     },
     { Header: "Score", accessor: "itemsStars" },
     { Header: "Comments", accessor: "reviewerComments" },
-    { Header: "Date Served", accessor: "dateItemServed" },
+    {},
   ];
 
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:22:7
     { Header: "Date Served", accessor: "dateItemServed" },
   ];
 
-  if (userOptions) {
+  if (true) {
     columns.push(
       ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th colspan="1" data-testid="ReviewTable-header-Edit" role="columnheader">Edit<span data-testid="ReviewTable-header-Edit-sort-carets" /></th> instead

[Killed] BlockStatement
main/components/Reviews/ReviewTable.js:22:20
     { Header: "Date Served", accessor: "dateItemServed" },
   ];
 
-  if (userOptions) {
-    columns.push(
-      ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", onDelete || (() => {}), "ReviewTable"),
-    );
-  }
+  if (userOptions) {}
 
   if (moderatorOptions) {
killedBy: ReviewTable Tests userOptions shows Edit/Delete buttons and calls callbacks
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-Edit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:24:39
 
   if (userOptions) {
     columns.push(
-      ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
+      ButtonColumn("Edit", "primary", true, "ReviewTable"),
     );
     columns.push(
killedBy: ReviewTable Tests userOptions shows Edit/Delete buttons and calls callbacks
statusReason: TypeError: callback is not a function

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:24:39
 
   if (userOptions) {
     columns.push(
-      ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
+      ButtonColumn("Edit", "primary", false, "ReviewTable"),
     );
     columns.push(
killedBy: ReviewTable Tests userOptions shows Edit/Delete buttons and calls callbacks
statusReason: TypeError: callback is not a function

[Killed] LogicalOperator
main/components/Reviews/ReviewTable.js:27:40
       ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", onDelete || (() => {}), "ReviewTable"),
+      ButtonColumn("Delete", "danger", onDelete && (() => {}), "ReviewTable"),
     );
   }
killedBy: ReviewTable Tests userOptions shows Edit/Delete buttons and calls callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:27:40
       ButtonColumn("Edit", "primary", onEdit || (() => {}), "ReviewTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", onDelete || (() => {}), "ReviewTable"),
+      ButtonColumn("Delete", "danger", false, "ReviewTable"),
     );
   }
killedBy: ReviewTable Tests userOptions shows Edit/Delete buttons and calls callbacks
statusReason: TypeError: callback is not a function

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:31:7
     );
   }
 
-  if (moderatorOptions) {
+  if (true) {
     columns.push(
       ButtonColumn(
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th colspan="1" data-testid="ReviewTable-header-Approve" role="columnheader">Approve<span data-testid="ReviewTable-header-Approve-sort-carets" /></th> instead

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:31:7
     );
   }
 
-  if (moderatorOptions) {
+  if (false) {
     columns.push(
       ButtonColumn(
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-header-Approve"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewTable.js:35:9
     columns.push(
       ButtonColumn(
         "Approve",
-        "success",
+        "",
         onApprove || (() => {}),
         "ReviewTable",
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /btn-success/
Received string:  "btn"

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:36:9
       ButtonColumn(
         "Approve",
         "success",
-        onApprove || (() => {}),
+        true,
         "ReviewTable",
       ),
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TypeError: callback is not a function

[Killed] LogicalOperator
main/components/Reviews/ReviewTable.js:36:9
       ButtonColumn(
         "Approve",
         "success",
-        onApprove || (() => {}),
+        onApprove && (() => {}),
         "ReviewTable",
       ),
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[Killed] StringLiteral
main/components/Reviews/ReviewTable.js:37:9
         "Approve",
         "success",
         onApprove || (() => {}),
-        "ReviewTable",
+        "",
       ),
     );
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Reviews/ReviewTable.js:41:40
       ),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", onReject || (() => {}), "ReviewTable"),
+      ButtonColumn("Reject", "danger", onReject && (() => {}), "ReviewTable"),
     );
   }
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 3
Received number of calls: 0

[Killed] ConditionalExpression
main/components/Reviews/ReviewTable.js:41:40
       ),
     );
     columns.push(
-      ButtonColumn("Reject", "danger", onReject || (() => {}), "ReviewTable"),
+      ButtonColumn("Reject", "danger", true, "ReviewTable"),
     );
   }
killedBy: ReviewTable Tests moderatorOptions shows Approve/Reject buttons and calls callbacks
statusReason: TypeError: callback is not a function
