[Killed] LogicalOperator
main/components/Reviews/ReviewsForm.js:20:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ReviewsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="ReviewsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
       </Row>
 
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Reviews/ReviewsForm.js:20:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ReviewsForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: ReviewsForm tests renders correctly when passing in a review
statusReason: Error: Unable to find an element by: [data-testid="ReviewsForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Reviews/ReviewsForm.js:37:8
         )}
       </Row>
 
-      {initialContents?.itemName && (
-        <Row>
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="itemName">Item Being Reviewed</Form.Label>
-              <Form.Control
-                data-testid="ReviewsForm-itemName"
-                id="itemName"
-                type="text"
-                value={initialContents.itemName}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        </Row>
-      )}
+      {false}
 
       <Row>
killedBy: ReviewsForm tests renders itemName field when initialContents.itemName is present
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewsForm-itemName"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Reviews/ReviewsForm.js:37:8
         )}
       </Row>
 
-      {initialContents?.itemName && (
+      {initialContents.itemName && (
         <Row>
           <Col>
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'itemName')

[Killed] StringLiteral
main/components/Reviews/ReviewsForm.js:65:28
               min={1}
               max={5}
               isInvalid={Boolean(errors.itemsStars)}
-              {...register("itemsStars", {
+              {...register("", {
                 required: "Stars are required.",
                 min: { value: 1, message: "Stars must be at least 1." },
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Reviews/ReviewsForm.js:66:27
               max={5}
               isInvalid={Boolean(errors.itemsStars)}
               {...register("itemsStars", {
-                required: "Stars are required.",
+                required: "",
                 min: { value: 1, message: "Stars must be at least 1." },
                 max: { value: 5, message: "Stars must be at most 5." },
killedBy: ReviewsForm tests Correct Error messages on missing input
statusReason: Error: Unable to find an element with the text: /Stars are required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Reviews/ReviewsForm.js:68:43
               {...register("itemsStars", {
                 required: "Stars are required.",
                 min: { value: 1, message: "Stars must be at least 1." },
-                max: { value: 5, message: "Stars must be at most 5." },
+                max: { value: 5, message: "" },
               })}
             />
killedBy: ReviewsForm tests displays error when stars is above maximum
statusReason: Error: Unable to find an element with the text: /Stars must be at most 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Reviews/ReviewsForm.js:68:22
               {...register("itemsStars", {
                 required: "Stars are required.",
                 min: { value: 1, message: "Stars must be at least 1." },
-                max: { value: 5, message: "Stars must be at most 5." },
+                max: {},
               })}
             />
killedBy: ReviewsForm tests displays error when stars is above maximum
statusReason: TypeError: e is not a function

[Killed] OptionalChaining
main/components/Reviews/ReviewsForm.js:72:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemsStars?.message}
+              {errors.itemsStars.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/Reviews/ReviewsForm.js:87:28
               id="dateReviewed"
               type="datetime-local"
               isInvalid={Boolean(errors.dateReviewed)}
-              {...register("dateReviewed", {
+              {...register("", {
                 required: "Date Reviewed is required.",
               })}
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Reviews/ReviewsForm.js:113:16
               {...register("reviewerComments")}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewerComments?.message}
+              {errors.reviewerComments.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewsForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
