[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:18:58
     { method: "GET", url: `/api/reviews/userReviews` },
   );
 
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [pendingDelete, setPendingDelete] = useState(null);
 
killedBy: MyReviewsIndexPage renders reviews table with edit and delete buttons
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] ArrowFunction
main/pages/MyReviews/MyReviewsIndexPage.js:22:5
   const [pendingDelete, setPendingDelete] = useState(null);
 
   const deleteMutation = useBackendMutation(
-    (review) => ({
-      url: "/api/reviews/reviewer",
-      method: "DELETE",
-      params: { id: review.id },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Review deleted"

Number of calls: 0

[Killed] ObjectLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:22:18
   const [pendingDelete, setPendingDelete] = useState(null);
 
   const deleteMutation = useBackendMutation(
-    (review) => ({
-      url: "/api/reviews/reviewer",
-      method: "DELETE",
-      params: { id: review.id },
-    }),
+    (review) => ({}),
     {
       onSuccess: () => {
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Review deleted"

Number of calls: 0

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:28:24
       params: { id: review.id },
     }),
     {
-      onSuccess: () => {
-        toast.success("Review deleted");
-        setShowDeleteModal(false);
-        setPendingDelete(null);
-      },
+      onSuccess: () => {},
       onError: () => {
         toast.error("Error deleting review");
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Review deleted"

Number of calls: 0

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:30:28
     {
       onSuccess: () => {
         toast.success("Review deleted");
-        setShowDeleteModal(false);
+        setShowDeleteModal(true);
         setPendingDelete(null);
       },
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:33:22
         setShowDeleteModal(false);
         setPendingDelete(null);
       },
-      onError: () => {
-        toast.error("Error deleting review");
-      },
+      onError: () => {},
     },
     // Stryker disable next-line all : don't test internal caching of React Query
killedBy: MyReviewsIndexPage shows error toast and keeps modal open on failed delete
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error deleting review"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:41:28
     ["/api/reviews/userReviews"],
   );
 
-  const onEdit = (cell) => {
-    const id = cell.row.original.id;
-    navigate(`/myreviews/edit/${id}`);
-  };
+  const onEdit = (cell) => {};
 
   const onDelete = (cell) => {
killedBy: MyReviewsIndexPage navigates to edit page when Edit button is clicked
statusReason: Error: Unable to find an element with the text: Edit Review. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:46:30
     navigate(`/myreviews/edit/${id}`);
   };
 
-  const onDelete = (cell) => {
-    setPendingDelete(cell.row.original);
-    setShowDeleteModal(true);
-  };
+  const onDelete = (cell) => {};
 
   const handleDeleteConfirm = () => {
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: Unable to find an element by: [data-testid="delete-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:48:24
 
   const onDelete = (cell) => {
     setPendingDelete(cell.row.original);
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
   };
 
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: Unable to find an element by: [data-testid="delete-modal"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:51:37
     setShowDeleteModal(true);
   };
 
-  const handleDeleteConfirm = () => {
-    // Stryker disable next-line all : don't test guard clause of pendingDelete
-    if (!pendingDelete) return;
-    deleteMutation.mutate(pendingDelete);
-  };
+  const handleDeleteConfirm = () => {};
 
   const handleDeleteCancel = () => {
killedBy: MyReviewsIndexPage deletes a review and updates table
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="ReviewTable-cell-row-0-col-reviewerComments" role="cell">Delicious!</td> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] BlockStatement
main/pages/MyReviews/MyReviewsIndexPage.js:57:36
     deleteMutation.mutate(pendingDelete);
   };
 
-  const handleDeleteCancel = () => {
-    setShowDeleteModal(false);
-    setPendingDelete(null);
-  };
+  const handleDeleteCancel = () => {};
 
   if (isLoading) {
killedBy: MyReviewsIndexPage closes modal and clears state when Cancel is clicked
statusReason: Error: expect(element).not.toBeInTheDocument()


Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:58:24
   };
 
   const handleDeleteCancel = () => {
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setPendingDelete(null);
   };
killedBy: MyReviewsIndexPage closes modal and clears state when Cancel is clicked
statusReason: Error: expect(element).not.toBeInTheDocument()


Ignored nodes: comments, script, style
<html>
  <head />
  <body

[Killed] ConditionalExpression
main/pages/MyReviews/MyReviewsIndexPage.js:62:7
     setPendingDelete(null);
   };
 
-  if (isLoading) {
+  if (true) {
     return (
       <BasicLayout>
killedBy: MyReviewsIndexPage renders reviews table with edit and delete buttons
statusReason: Error: Unable to find an element with the text: Delicious!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/MyReviews/MyReviewsIndexPage.js:62:7
     setPendingDelete(null);
   };
 
-  if (isLoading) {
+  if (false) {
     return (
       <BasicLayout>
killedBy: MyReviewsIndexPage renders reviews table with edit and delete buttons
statusReason: TypeError: Cannot read properties of undefined (reading 'forEach')

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:84:22
       <h1>My Reviews</h1>
       <ReviewTable
         data={data}
-        userOptions={true}
+        userOptions={false}
         moderatorOptions={false}
         onEdit={onEdit}
killedBy: MyReviewsIndexPage renders reviews table with edit and delete buttons
statusReason: TestingLibraryElementError: Unable to find an element with the text: Edit. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:85:27
       <ReviewTable
         data={data}
         userOptions={true}
-        moderatorOptions={false}
+        moderatorOptions={true}
         onEdit={onEdit}
         onDelete={onDelete}
killedBy: MyReviewsIndexPage renders reviews table with edit and delete buttons
statusReason: TestingLibraryElementError: Found multiple elements with the text: Approve

Here are the matching elements:

Ignored nodes: comments, script, style
<th
  colspan="1"
  data-testid="ReviewTable-header-Approve"

[Killed] StringLiteral
main/pages/MyReviews/MyReviewsIndexPage.js:107:41
             onClick={handleDeleteConfirm}
             disabled={deleteMutation.isLoading}
           >
-            {deleteMutation.isLoading ? "Deleting..." : "Delete"}
+            {deleteMutation.isLoading ? "" : "Delete"}
           </Button>
         </Modal.Footer>
killedBy: MyReviewsIndexPage shows loading state on delete button while deleting
statusReason: Error: Unable to find an element with the text: text => text.includes("Deleting"). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
