[Killed] ObjectLiteral
main/pages/MyReviews/ReviewEditPage.js:24:36
   );
 
   // Stryker disable next-line StringLiteral: The default value for dateItemServed is never exposed to the user; this mutant is not killable without a UX-breaking refactor.
-  const [form, setForm] = useState({
-    itemStars: 0,
-    reviewerComments: "",
-    // Stryker disable next-line StringLiteral: The default value for dateItemServed is never exposed to the user; this mutant is not killable without a UX-breaking refactor.
-    dateItemServed: "",
-  });
+  const [form, setForm] = useState({});
 
   useEffect(() => {
killedBy: ReviewEditPage form uses default values when review fields are missing
statusReason: Error: expect(element).toHaveValue(0)

Expected the element to have value:
  0
Received:
  null

[Killed] BlockStatement
main/pages/MyReviews/ReviewEditPage.js:31:19
     dateItemServed: "",
   });
 
-  useEffect(() => {
-    if (review) {
-      setForm({
-        itemStars: review.itemStars ?? review.itemsStars,
-        reviewerComments: review.reviewerComments,
-        // Stryker disable next-line all : don't test fallback value
-        dateItemServed: review.dateItemServed?.slice(0, 16) || "",
-      });
-    }
-  }, [review]);
+  useEffect(() => {}, [review]);
 
   const objectToAxiosParams = (formData) => ({
killedBy: ReviewEditPage renders and pre-fills form
statusReason: Error: Unable to find an element with the display value: 3.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MyReviews/ReviewEditPage.js:32:17
   });
 
   useEffect(() => {
-    if (review) {
-      setForm({
-        itemStars: review.itemStars ?? review.itemsStars,
-        reviewerComments: review.reviewerComments,
-        // Stryker disable next-line all : don't test fallback value
-        dateItemServed: review.dateItemServed?.slice(0, 16) || "",
-      });
-    }
+    if (review) {}
   }, [review]);
 
killedBy: ReviewEditPage renders and pre-fills form
statusReason: Error: Unable to find an element with the display value: 3.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/MyReviews/ReviewEditPage.js:32:9
   });
 
   useEffect(() => {
-    if (review) {
+    if (false) {
       setForm({
         itemStars: review.itemStars ?? review.itemsStars,
killedBy: ReviewEditPage renders and pre-fills form
statusReason: Error: Unable to find an element with the display value: 3.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/MyReviews/ReviewEditPage.js:33:15
 
   useEffect(() => {
     if (review) {
-      setForm({
-        itemStars: review.itemStars ?? review.itemsStars,
-        reviewerComments: review.reviewerComments,
-        // Stryker disable next-line all : don't test fallback value
-        dateItemServed: review.dateItemServed?.slice(0, 16) || "",
-      });
+      setForm({});
     }
   }, [review]);
killedBy: ReviewEditPage renders and pre-fills form
statusReason: Error: Unable to find an element with the display value: 3.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/MyReviews/ReviewEditPage.js:34:20
   useEffect(() => {
     if (review) {
       setForm({
-        itemStars: review.itemStars ?? review.itemsStars,
+        itemStars: review.itemStars && review.itemsStars,
         reviewerComments: review.reviewerComments,
         // Stryker disable next-line all : don't test fallback value
killedBy: ReviewEditPage renders and pre-fills form
statusReason: Error: Unable to find an element with the display value: 3.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MyReviews/ReviewEditPage.js:42:31
     }
   }, [review]);
 
-  const objectToAxiosParams = (formData) => ({
-    url: "/api/reviews/reviewer",
-    method: "PUT",
-    params: { id },
-    data: {
-      itemStars: Number(formData.itemStars),
-      reviewerComments: formData.reviewerComments,
-      dateItemServed: formData.dateItemServed,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const mutation = useBackendMutation(objectToAxiosParams, {
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MyReviews/ReviewEditPage.js:44:13
 
   const objectToAxiosParams = (formData) => ({
     url: "/api/reviews/reviewer",
-    method: "PUT",
+    method: "",
     params: { id },
     data: {
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/MyReviews/ReviewEditPage.js:46:11
     url: "/api/reviews/reviewer",
     method: "PUT",
     params: { id },
-    data: {
-      itemStars: Number(formData.itemStars),
-      reviewerComments: formData.reviewerComments,
-      dateItemServed: formData.dateItemServed,
-    },
+    data: {},
   });
 
killedBy: ReviewEditPage sends correct PUT payload on edit
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"itemStars\":4"
Received string:    "{}"

[Killed] ObjectLiteral
main/pages/MyReviews/ReviewEditPage.js:53:60
     },
   });
 
-  const mutation = useBackendMutation(objectToAxiosParams, {
-    onSuccess: () => {
-      toast.success("Review updated");
-      navigate("/myreviews");
-    },
-    onError: () => toast.error("Failed to update review"),
-  });
+  const mutation = useBackendMutation(objectToAxiosParams, {});
 
   const handleChange = (e) => {
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/MyReviews/ReviewEditPage.js:54:22
   });
 
   const mutation = useBackendMutation(objectToAxiosParams, {
-    onSuccess: () => {
-      toast.success("Review updated");
-      navigate("/myreviews");
-    },
+    onSuccess: () => {},
     onError: () => toast.error("Failed to update review"),
   });
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MyReviews/ReviewEditPage.js:56:16
   const mutation = useBackendMutation(objectToAxiosParams, {
     onSuccess: () => {
       toast.success("Review updated");
-      navigate("/myreviews");
+      navigate("");
     },
     onError: () => toast.error("Failed to update review"),
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MyReviews/ReviewEditPage.js:58:14
       toast.success("Review updated");
       navigate("/myreviews");
     },
-    onError: () => toast.error("Failed to update review"),
+    onError: () => undefined,
   });
 
killedBy: ReviewEditPage shows error toast on failed edit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/MyReviews/ReviewEditPage.js:61:31
     onError: () => toast.error("Failed to update review"),
   });
 
-  const handleChange = (e) => {
-    const { name, value } = e.target;
-    setForm((f) => ({ ...f, [name]: value }));
-  };
+  const handleChange = (e) => {};
 
   const handleSubmit = (e) => {
killedBy: ReviewEditPage sends correct PUT payload on edit
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "\"itemStars\":4"
Received string:    "{\"itemStars\":3,\"reviewerComments\":\"Good food!\",\"dateItemServed\":\"2025-05-24T12:00\"}"

[Killed] ArrowFunction
main/pages/MyReviews/ReviewEditPage.js:63:13
 
   const handleChange = (e) => {
     const { name, value } = e.target;
-    setForm((f) => ({ ...f, [name]: value }));
+    setForm(() => undefined);
   };
 
killedBy: ReviewEditPage submits edit and navigates
statusReason: TypeError: Cannot read properties of undefined (reading 'itemStars')

[Killed] BlockStatement
main/pages/MyReviews/ReviewEditPage.js:66:31
     setForm((f) => ({ ...f, [name]: value }));
   };
 
-  const handleSubmit = (e) => {
-    e.preventDefault();
-    mutation.mutate(form);
-  };
+  const handleSubmit = (e) => {};
 
   // Stryker disable next-line all : don't test loading state
killedBy: ReviewEditPage submits edit and navigates
statusReason: Error: Unable to find an element with the text: My Reviews Page. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/MyReviews/ReviewEditPage.js:125:15
             {mutation.isLoading ? (
               <Spinner size="sm" animation="border" />
             ) : (
-              "Save"
+              ""
             )}
           </Button>
killedBy: ReviewEditPage submits edit and navigates
statusReason: TestingLibraryElementError: Unable to find an element with the text: Save. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
