[Killed] BlockStatement
main/pages/Reviews/ReviewsEditPage.js:4:45
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 import { useParams } from "react-router";
 
-export default function ReviewsCreatePage() {
-  const { id } = useParams();
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit review with id {id}</h1>
-        <p>Coming Soon!</p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function ReviewsCreatePage() {}
 
killedBy: ReviewsEditPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Edit review with id 1. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
