[Killed] BlockStatement
main/pages/Reviews/ReviewsForMenuItemPage.js:16:18
     { method: "GET", url: `/api/diningcommons/menuitem?id=${id}` },
   );
 
-  if (isLoading) {
-    return (
-      <BasicLayout>
-        <p>Loading...</p>
-      </BasicLayout>
-    );
-  }
+  if (isLoading) {}
 
   // Stryker disable next-line all : Don't mutate error block
killedBy: ReviewsForMenuItemPage shows loading state
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] OptionalChaining
main/pages/Reviews/ReviewsForMenuItemPage.js:35:20
 
   const filteredReviews =
     // Stryker disable next-line ArrayDeclaration : Don't mutate fallback array
-    (Array.isArray(data?.reviews) ? data.reviews : []).filter(
+    (Array.isArray(data.reviews) ? data.reviews : []).filter(
       (review) =>
         review.reviewerComments !== null &&
killedBy: ReviewsForMenuItemPage renders zero rows if data is null
statusReason: TypeError: Cannot read properties of null (reading 'reviews')

[Killed] MethodExpression
main/pages/Reviews/ReviewsForMenuItemPage.js:35:5
 
   const filteredReviews =
     // Stryker disable next-line ArrayDeclaration : Don't mutate fallback array
-    (Array.isArray(data?.reviews) ? data.reviews : []).filter(
-      (review) =>
-        review.reviewerComments !== null &&
-        review.reviewerComments !== undefined,
-    );
+    Array.isArray(data?.reviews) ? data.reviews : [];
 
   return (
killedBy: ReviewsForMenuItemPage renders only reviews with non-null comments (row count)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ArrowFunction
main/pages/Reviews/ReviewsForMenuItemPage.js:36:7
   const filteredReviews =
     // Stryker disable next-line ArrayDeclaration : Don't mutate fallback array
     (Array.isArray(data?.reviews) ? data.reviews : []).filter(
-      (review) =>
-        review.reviewerComments !== null &&
-        review.reviewerComments !== undefined,
+      () => undefined,
     );
 
killedBy: ReviewsForMenuItemPage filters out reviews with null comments
statusReason: Error: Unable to find an element with the text: Great!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Reviews/ReviewsForMenuItemPage.js:37:9
     // Stryker disable next-line ArrayDeclaration : Don't mutate fallback array
     (Array.isArray(data?.reviews) ? data.reviews : []).filter(
       (review) =>
-        review.reviewerComments !== null &&
+        review.reviewerComments === null &&
         review.reviewerComments !== undefined,
     );
killedBy: ReviewsForMenuItemPage filters out reviews with null comments
statusReason: Error: Unable to find an element with the text: Great!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/Reviews/ReviewsForMenuItemPage.js:37:9
     // Stryker disable next-line ArrayDeclaration : Don't mutate fallback array
     (Array.isArray(data?.reviews) ? data.reviews : []).filter(
       (review) =>
-        review.reviewerComments !== null &&
-        review.reviewerComments !== undefined,
+        review.reviewerComments !== null || review.reviewerComments !== undefined,
     );
 
killedBy: ReviewsForMenuItemPage renders only reviews with non-null comments (row count)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] EqualityOperator
main/pages/Reviews/ReviewsForMenuItemPage.js:38:9
     (Array.isArray(data?.reviews) ? data.reviews : []).filter(
       (review) =>
         review.reviewerComments !== null &&
-        review.reviewerComments !== undefined,
+        review.reviewerComments === undefined,
     );
 
killedBy: ReviewsForMenuItemPage filters out reviews with null comments
statusReason: Error: Unable to find an element with the text: Great!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Reviews/ReviewsForMenuItemPage.js:38:9
     (Array.isArray(data?.reviews) ? data.reviews : []).filter(
       (review) =>
         review.reviewerComments !== null &&
-        review.reviewerComments !== undefined,
+        true,
     );
 
killedBy: ReviewsForMenuItemPage renders only reviews with non-null comments (row count)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] BooleanLiteral
main/pages/Reviews/ReviewsForMenuItemPage.js:46:22
       <h1>Reviews for Menu Item {id}</h1>
       <ReviewTable
         data={filteredReviews}
-        userOptions={false}
+        userOptions={true}
         moderatorOptions={false}
       />
killedBy: ReviewsForMenuItemPage does not show user or moderator action buttons
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-primary" data-testid="ReviewTable-cell-row-0-col-Edit-button" type="button">Edit</button> instead

[Killed] BooleanLiteral
main/pages/Reviews/ReviewsForMenuItemPage.js:47:27
       <ReviewTable
         data={filteredReviews}
         userOptions={false}
-        moderatorOptions={false}
+        moderatorOptions={true}
       />
     </BasicLayout>
killedBy: ReviewsForMenuItemPage does not show user or moderator action buttons
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="ReviewTable-cell-row-0-col-Approve-button" type="button">Approve</button> instead
